# Homebrew package list (for brew bundle)
# Install with: brew bundle --file=~/.config/packages/brewfile

# Development tools
{{- if eq .chezmoi.os "darwin" }}
brew "git"
brew "tmux"
brew "fzf"
brew "gh"
brew "ripgrep"
brew "eza"
brew "jq"
brew "yq"
brew "tig"
brew "gpg"
brew "bat"
{{- end }}
brew "delta"
{{- if not .minimal }}
brew "neovim"
brew "luarocks"
{{- end }}
brew "fd"
brew "the_platinum_searcher"
{{- if not .minimal }}
brew "ghq"
{{- end }}
{{- if eq .chezmoi.os "darwin" }}
brew "zoxide"
{{- end }}

# System tools
{{- if eq .chezmoi.os "darwin" }}
brew "htop"
brew "ncdu"
brew "tree"
brew "wget"
brew "curl"
brew "envchain"
brew "direnv"
{{- end }}

# Container tools (macOS only; install from package manager on Linux)
{{- if eq .chezmoi.os "darwin" }}
brew "docker"
brew "docker-compose"
brew "colima"
{{- end }}

# Cloud tools
{{- if eq .chezmoi.os "darwin" }}
brew "awscli"
{{- end }}
brew "kubectl"
brew "helm"
